---
kind: property
id: P:Autodesk.Revit.DB.SolidCurveIntersection.SegmentCount
source: html/9a65a609-04a2-b980-d430-3cc651283213.htm
---
# Autodesk.Revit.DB.SolidCurveIntersection.SegmentCount Property

The number of segments in the results.

## Syntax (C#)
```csharp
public int SegmentCount { get; }
```